import React from 'react';
import styles from './AboutCompany.module.scss';
import SubTitle from "@/shared/UI/SubTitle/SubTitle";
import image from '@/data/images/about/tk.png';
import {TImage} from "@/types/IImage";
import Image from "next/image";
import Advantages, {IAdvantageEl} from "@/widgets/Advantages/Advantages";

const tkImage: TImage = image;

const advantages: IAdvantageEl[] = [
    {
        icon: (<svg width="56" height="56" viewBox="0 0 56 56" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path
                d="M8.575 25.9L25.2 3.73447C25.526 3.29979 25.9488 2.94697 26.4348 2.70398C26.9207 2.46098 27.4566 2.33447 28 2.33447C28.5434 2.33447 29.0793 2.46098 29.5652 2.70398C30.0512 2.94697 30.474 3.29979 30.8 3.73447L47.425 25.9C47.8794 26.5058 48.125 27.2427 48.125 28C48.125 28.7573 47.8794 29.4941 47.425 30.1L30.8 52.2655C30.474 52.7002 30.0512 53.053 29.5652 53.296C29.0793 53.539 28.5434 53.6655 28 53.6655C27.4566 53.6655 26.9207 53.539 26.4348 53.296C25.9488 53.053 25.526 52.7002 25.2 52.2655L8.575 30.1C8.12062 29.4941 7.875 28.7573 7.875 28C7.875 27.2427 8.12062 26.5058 8.575 25.9Z"
                fill="#FAFAFA"/>
            <path d="M20.125 34.125L15.8715 29.3337C15.2982 28.6879 15.2817 27.7204 15.8327 27.0554L20.125 21.875"
                  stroke="#00A651" strokeWidth="3.5" strokeLinecap="round" strokeLinejoin="round"/>
        </svg>),
        text: 'Премиальные материалы',
    },
    {
        icon: (<svg width="52" height="52" viewBox="0 0 52 52" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path
                d="M26.0003 1.85714C12.6672 1.85714 1.85742 12.6669 1.85742 26C1.85742 39.3331 12.6672 50.1429 26.0003 50.1429C39.3334 50.1429 50.1431 39.3331 50.1431 26C50.1431 12.6669 39.3334 1.85714 26.0003 1.85714ZM37.1431 29.7143H26.0003C25.5077 29.7143 25.0354 29.5186 24.6871 29.1703C24.3388 28.8221 24.1431 28.3497 24.1431 27.8571V11.1429C24.1431 10.6503 24.3388 10.1779 24.6871 9.82966C25.0354 9.48137 25.5077 9.28571 26.0003 9.28571C26.4928 9.28571 26.9652 9.48137 27.3135 9.82966C27.6618 10.1779 27.8574 10.6503 27.8574 11.1429V26H37.1431C37.6357 26 38.1081 26.1957 38.4563 26.5439C38.8046 26.8922 39.0003 27.3646 39.0003 27.8571C39.0003 28.3497 38.8046 28.8221 38.4563 29.1703C38.1081 29.5186 37.6357 29.7143 37.1431 29.7143Z"
                fill="#FAFAFA"/>
        </svg>),
        text: 'Сроки без задержек',
    },
    {
        icon: (<svg width="52" height="52" viewBox="0 0 52 52" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                    d="M44.7488 29.8091L43.8846 29.3097C42.8562 28.7166 42.2418 27.6521 42.2418 26.4643C42.2418 25.2765 42.8562 24.2119 43.8846 23.6189L44.7488 23.1194C47.1079 21.7558 47.9146 18.7461 46.5526 16.387L44.9098 13.5416C43.5511 11.1874 40.5299 10.3791 38.1773 11.7377L37.3132 12.2355C36.2848 12.8302 35.0543 12.8302 34.0275 12.2355C32.9991 11.6408 32.3846 10.5779 32.3846 9.39006V8.39285C32.3846 5.67557 30.1733 3.46428 27.4561 3.46428H24.1703C21.4531 3.46428 19.2418 5.67557 19.2418 8.39285V9.39171C19.2418 10.5795 18.6273 11.6424 17.5989 12.2371C16.5705 12.8302 15.3416 12.8319 14.3132 12.2371L13.4491 11.7377C11.0965 10.3791 8.07528 11.1874 6.71499 13.5416L5.07213 16.387C3.71021 18.7461 4.51685 21.7575 6.87599 23.1194L7.74178 23.6189C8.77021 24.2119 9.38463 25.2765 9.38463 26.4643C9.38463 27.6521 8.77021 28.7166 7.74178 29.3097L6.87764 29.8091C4.51849 31.1711 3.71185 34.1824 5.07378 36.5416L6.71663 39.387C8.07692 41.7412 11.0981 42.5495 13.4491 41.1909L14.3132 40.6931C15.3416 40.0967 16.5705 40.1 17.5989 40.6931C18.6273 41.2878 19.2418 42.3507 19.2418 43.5385V44.5357C19.2418 47.253 21.4531 49.4643 24.1703 49.4643H27.4561C30.1733 49.4643 32.3846 47.253 32.3846 44.5357V43.5369C32.3846 42.3491 32.9991 41.2861 34.0275 40.6914C35.0543 40.0984 36.2848 40.0967 37.3132 40.6914L38.1773 41.1909C40.5299 42.5479 43.5511 41.7396 44.9098 39.387L46.5526 36.5416C47.9146 34.1824 47.1079 31.1711 44.7488 29.8091ZM25.8132 34.6786C21.2838 34.6786 17.5989 30.9936 17.5989 26.4643C17.5989 21.9349 21.2838 18.25 25.8132 18.25C30.3426 18.25 34.0275 21.9349 34.0275 26.4643C34.0275 30.9936 30.3426 34.6786 25.8132 34.6786Z"
                    fill="#FAFAFA"/>
            </svg>),
        text: 'Европейское оборудование',
    }
];

const AboutCompany = () => {
    return (
        <div className={styles.main}>
            <div className={styles.wrapper}>
                <SubTitle classNames={styles.title}>О компании</SubTitle>
                <div className={styles.content}>
                    <div className={`${styles.textEl} ${styles.textEl_firstEl}`}>
                        <span className={styles.text}>
                            <span className={styles.green}>С 1998 года</span> мы
                            создаем качественную <br/> и функциональную мебель,
                            сочетая <br/> технологии и индивидуальный подход</span>
                    </div>
                    <div className={`${styles.textEl} ${styles.textEl_secondEl}`}>
                        <span className={styles.text}>
                            <span className={styles.green}>Наша миссия</span> —
                            делать ваш дом уютнее, <br/> предлагая надежные решения с
                            гарантией <br/> до 10 лет</span>
                    </div>
                    <div className={`${styles.textEl} ${styles.textEl_thirdEl}`}>
                        <span className={styles.text}>
                            <span className={styles.green}>Более 4000 кв.м</span> собственного
                            производства, <br/> оснащенного европейским оборудованием, <br/>
                            позволяют нам выполнять заказы любой сложности</span>
                    </div>
                    <div className={`${styles.textEl} ${styles.textEl_fourthEl}`}>
                        <span className={styles.text}>
                            <span className={styles.green}>Мы ценим</span> доверие
                            клиентов, экологичность <br/> материалов и безупречный сервис от
                            замера <br/> до монтажа</span>
                    </div>
                </div>
                <div className={styles.imageWrapper}>
                    <Image
                        width={603}
                        height={603}
                        src={tkImage.src}
                        alt={''}
                        className={styles.bgImage}
                    />
                </div>
            </div>
            <Advantages
                elements={advantages}
            />
        </div>
    );
};

export default AboutCompany;