import {Metadata} from "next";
import {pagesData} from "@/shared/constants";
import styles from '@/app/styles/pages/main.module.scss';
import SliderScreen, {PhotoSliderSlides} from "@/widgets/SliderScreen/SliderScreen";
import Advantages, {IAdvantageEl} from "@/widgets/Advantages/Advantages";
import CatalogNav from "@/widgets/CatalogNav/CatalogNav";
import PhraseOrder from "@/widgets/PhraseOrder/PhraseOrder";
import ProjectSequence from "@/widgets/ProjectSequence/ProjectSequence";
import ReviewsInfo from "@/widgets/ReviewsInfo/ReviewsInfo";
import OrderForms from "@/widgets/OrderForms/OrderForms";
import ExamplesSlider from "@/widgets/ExamplesSlider/ExamplesSlider";
import Questions from "@/widgets/Questions/Questions";
import Footer from "@/widgets/Footer/Footer";
import React from "react";
import QuestionsService from "@/services/QuestionsService";

export const metadata: Metadata = {
  metadataBase: new URL(pagesData.main.url),
  title: pagesData.main.title,
  description: pagesData.main.description,
  keywords: pagesData.main.keywords,
}

const startScreenSlides: PhotoSliderSlides = [
    {
        photo: '/sliders/main/start-slider-1.png',
        photoAlt: 'Кухня',
        title: 'Мебель на заказ <br>в Москве',
        text: 'Кухни и корпусная мебель по вашим размерам<br> в Москве и Московской области<br> под ключ за 20 дней'
    },
    {
        photo: '/sliders/main/start-slider-2.png',
        photoAlt: 'Кухня',
        title: 'Шкафы, прихожие <br>и гардеробные',
        text: 'Изготовим мебель по вашему проекту<br> из качественных материалов<br> по приемлемым ценам'
    },
    {
        photo: '/sliders/main/start-slider-3.png',
        photoAlt: 'Кухня',
        title: 'Комплексная меблировка <br>под ключ',
        text: 'Полный спектр услуг<br> по изготовлению мебели с гарантией:<br> от прихожей до ванной комнаты'
    },
    {
        photo: '/sliders/main/start-slider-4.png',
        photoAlt: 'Кухня',
        title: 'Офисная мебель <br>на заказ в Москве',
        text: 'Шкафы, стеллажи, столы, тумбы — все<br> для эргономичного обустройства офисного пространства'
    },
    {
        photo: '/sliders/main/start-slider-5.png',
        photoAlt: 'Кухня',
        title: 'Мебель в любую комнату <br>в вашем дизайне',
        text: 'Мебель для всей квартиры<br> по индивидуальному проекту от производителя'
    },
];

const examplesSlides: PhotoSliderSlides = [
    {
        photo: '/sliders/examples/yellow.jpg',
        photoAlt: 'Желтая',
        title: 'Белая детская с деревом',
        text: 'Функциональная мебель для детской комнаты в белом цвете с корпусом Egger под дерево. Отличное сочетание вместительных шкафов и рабочей зоны с подсветкой.'
    },
    {
        photo: '/sliders/examples/turquoise.jpg',
        photoAlt: 'Бирюзовая',
        title: 'Шкаф с подвесной тумбой',
        text: 'Стильный шкаф в цвете графит и подвесная тумба из ЛДСП Egger с антуражной подсветкой в гостинной. Накладные профиль-ручки в черном цвете.'
    },
    {
        photo: '/sliders/examples/black.jpg',
        photoAlt: 'Бежевая кухня',
        title: 'Бежевая кухня. Еггер',
        text: 'Эффектная угловая кухня в бежевых тонах с фрезерованными фасадами и столешницей из искусственного камня.'
    },
    {
        photo: '/sliders/examples/blue.jpg',
        photoAlt: 'Синяя',
        title: 'Шкаф в спальню',
        text: 'Белый шкаф в спальню с открытыми полками. Консервативное и функциональное решение для комнат небольшой площадью.'
    },
    {
        photo: '/sliders/examples/green.jpg',
        photoAlt: 'Зеленая',
        title: 'Серая гостиная с рабочим местом',
        text: 'Функциональная прямая гостиная в белом цвете: шкаф, тумба под ТВ, рабочее место. 3 в 1 для максимального использования пространства.'
    },
];

const advantages: IAdvantageEl[] = [
    {
        icon: (<svg width="52" height="52" viewBox="0 0 52 52" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path
                d="M26.0003 1.85714C12.6672 1.85714 1.85742 12.6669 1.85742 26C1.85742 39.3331 12.6672 50.1429 26.0003 50.1429C39.3334 50.1429 50.1431 39.3331 50.1431 26C50.1431 12.6669 39.3334 1.85714 26.0003 1.85714ZM37.1431 29.7143H26.0003C25.5077 29.7143 25.0354 29.5186 24.6871 29.1703C24.3388 28.8221 24.1431 28.3497 24.1431 27.8571V11.1429C24.1431 10.6503 24.3388 10.1779 24.6871 9.82966C25.0354 9.48137 25.5077 9.28571 26.0003 9.28571C26.4928 9.28571 26.9652 9.48137 27.3135 9.82966C27.6618 10.1779 27.8574 10.6503 27.8574 11.1429V26H37.1431C37.6357 26 38.1081 26.1957 38.4563 26.5439C38.8046 26.8922 39.0003 27.3646 39.0003 27.8571C39.0003 28.3497 38.8046 28.8221 38.4563 29.1703C38.1081 29.5186 37.6357 29.7143 37.1431 29.7143Z"
                fill="#FAFAFA"/>
        </svg>),
        text: 'Срок изготовления от 20 до 45 дней',
    },
    {
        icon: (<svg width="56" height="56" viewBox="0 0 56 56" fill="none" xmlns="http://www.w3.org/2000/svg">
            <g clipPath="url(#clip0_278_442)">
                <path
                    d="M27.9999 30.7081C32.9653 30.7081 36.9905 26.6828 36.9905 21.7174C36.9905 16.752 32.9653 12.7268 27.9999 12.7268C23.0345 12.7268 19.0093 16.752 19.0093 21.7174C19.0093 26.6828 23.0345 30.7081 27.9999 30.7081Z"
                    fill="#FAFAFA"/>
                <path
                    d="M49.1488 20.9216C49.444 20.5387 49.6595 20.1005 49.7823 19.6329C49.9052 19.1653 49.933 18.6778 49.864 18.1993C49.7951 17.7208 49.6308 17.261 49.381 16.8471C49.1311 16.4332 48.8007 16.0736 48.4094 15.7897L46.8782 14.6784C46.3733 14.3123 45.9717 13.8217 45.7126 13.2544C45.4535 12.687 45.3456 12.0623 45.3994 11.4409L45.5613 9.55531C45.6055 9.07215 45.552 8.58503 45.404 8.12299C45.2559 7.66095 45.0163 7.23347 44.6995 6.86601C44.3827 6.49856 43.9951 6.19867 43.5599 5.98422C43.1247 5.76977 42.6507 5.64516 42.1663 5.61781L40.2763 5.51281C39.6538 5.47736 39.0511 5.28145 38.5267 4.94414C38.0023 4.60682 37.5742 4.13957 37.2838 3.58781L36.4088 1.91218C36.1819 1.48484 35.8715 1.10741 35.496 0.802288C35.1204 0.497164 34.6875 0.270559 34.2227 0.135911C33.758 0.0012627 33.2709 -0.0386861 32.7905 0.0184338C32.31 0.0755537 31.8459 0.228579 31.4257 0.468434L29.7807 1.40031C29.2376 1.70782 28.6241 1.86945 28 1.86945C27.376 1.86945 26.7625 1.70782 26.2194 1.40031L24.5744 0.468434C24.1533 0.22994 23.6886 0.0784527 23.2079 0.0229593C22.7271 -0.0325341 22.2401 0.00909699 21.7758 0.145383C21.3114 0.281668 20.8792 0.509832 20.5047 0.816338C20.1302 1.12284 19.8211 1.50145 19.5957 1.92968L18.7207 3.60531C18.4303 4.15707 18.0021 4.62432 17.4778 4.96164C16.9534 5.29895 16.3507 5.49486 15.7282 5.53031L13.8382 5.63531C13.3538 5.66266 12.8798 5.78727 12.4446 6.00172C12.0094 6.21617 11.6218 6.51606 11.305 6.88351C10.9882 7.25097 10.7486 7.67845 10.6005 8.14049C10.4524 8.60253 10.3989 9.08965 10.4432 9.57281L10.605 11.4584C10.6589 12.0798 10.551 12.7045 10.2919 13.2719C10.0328 13.8392 9.63121 14.3298 9.1263 14.6959L7.59505 15.8072C7.20373 16.0911 6.87336 16.4507 6.62351 16.8646C6.37365 17.2785 6.20939 17.7383 6.14045 18.2168C6.0715 18.6953 6.09928 19.1828 6.22214 19.6504C6.34499 20.118 6.56042 20.5562 6.85567 20.9391L8.01067 22.4353C8.39191 22.9287 8.639 23.5123 8.72793 24.1295C8.81686 24.7466 8.7446 25.3762 8.51817 25.9572L7.8313 27.7072C7.65571 28.1576 7.57226 28.6386 7.5859 29.1218C7.59953 29.605 7.70997 30.0805 7.91068 30.5203C8.11138 30.96 8.39827 31.3551 8.75437 31.682C9.11046 32.0089 9.52852 32.261 9.9838 32.4234L11.7644 33.0578C12.3523 33.2668 12.8761 33.6245 13.2847 34.096C13.6934 34.5675 13.973 35.1368 14.0963 35.7484L14.4375 37.4109L9.89192 52.1853L17.1019 49.9278L21.5907 56.0003L25.69 42.5997C26.3036 43.109 27.0684 43.401 27.8653 43.4303C28.6622 43.4595 29.4464 43.2244 30.0957 42.7616L34.4094 56.0003L38.8982 49.9278L46.1082 52.1853L41.4532 37.9053C41.4838 37.8047 41.51 37.7084 41.5319 37.6034L41.9038 35.7484C42.0271 35.1368 42.3067 34.5675 42.7154 34.096C43.124 33.6245 43.6478 33.2668 44.2357 33.0578L46.0163 32.4234C46.4716 32.261 46.8896 32.0089 47.2457 31.682C47.6018 31.3551 47.8887 30.96 48.0894 30.5203C48.2901 30.0805 48.4006 29.605 48.4142 29.1218C48.4278 28.6386 48.3444 28.1576 48.1688 27.7072L47.4819 25.9572C47.2555 25.3762 47.1832 24.7466 47.2722 24.1295C47.3611 23.5123 47.6082 22.9287 47.9894 22.4353L49.1488 20.9216ZM15.5094 21.7178C15.5094 19.2474 16.242 16.8325 17.6145 14.7784C18.987 12.7243 20.9377 11.1234 23.2201 10.178C25.5025 9.23259 28.0139 8.98523 30.4368 9.46719C32.8598 9.94914 35.0854 11.1388 36.8323 12.8856C38.5791 14.6324 39.7687 16.8581 40.2507 19.281C40.7326 21.704 40.4853 24.2154 39.5399 26.4978C38.5945 28.7801 36.9935 30.7309 34.9395 32.1034C32.8854 33.4759 30.4705 34.2084 28 34.2084C24.6884 34.205 21.5134 32.8879 19.1717 30.5462C16.83 28.2045 15.5129 25.0295 15.5094 21.7178Z"
                    fill="#FAFAFA"/>
            </g>
            <defs>
                <clipPath id="clip0_278_442">
                    <rect width="56" height="56" fill="white"/>
                </clipPath>
            </defs>
        </svg>),
        text: 'Гарантия на мебель до 10 лет',
    },
    {
        icon: (<svg width="52" height="52" viewBox="0 0 52 52" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path
                d="M44.7488 29.8091L43.8846 29.3097C42.8562 28.7166 42.2418 27.6521 42.2418 26.4643C42.2418 25.2765 42.8562 24.2119 43.8846 23.6189L44.7488 23.1194C47.1079 21.7558 47.9146 18.7461 46.5526 16.387L44.9098 13.5416C43.5511 11.1874 40.5299 10.3791 38.1773 11.7377L37.3132 12.2355C36.2848 12.8302 35.0543 12.8302 34.0275 12.2355C32.9991 11.6408 32.3846 10.5779 32.3846 9.39006V8.39285C32.3846 5.67557 30.1733 3.46428 27.4561 3.46428H24.1703C21.4531 3.46428 19.2418 5.67557 19.2418 8.39285V9.39171C19.2418 10.5795 18.6273 11.6424 17.5989 12.2371C16.5705 12.8302 15.3416 12.8319 14.3132 12.2371L13.4491 11.7377C11.0965 10.3791 8.07528 11.1874 6.71499 13.5416L5.07213 16.387C3.71021 18.7461 4.51685 21.7575 6.87599 23.1194L7.74178 23.6189C8.77021 24.2119 9.38463 25.2765 9.38463 26.4643C9.38463 27.6521 8.77021 28.7166 7.74178 29.3097L6.87764 29.8091C4.51849 31.1711 3.71185 34.1824 5.07378 36.5416L6.71663 39.387C8.07692 41.7412 11.0981 42.5495 13.4491 41.1909L14.3132 40.6931C15.3416 40.0967 16.5705 40.1 17.5989 40.6931C18.6273 41.2878 19.2418 42.3507 19.2418 43.5385V44.5357C19.2418 47.253 21.4531 49.4643 24.1703 49.4643H27.4561C30.1733 49.4643 32.3846 47.253 32.3846 44.5357V43.5369C32.3846 42.3491 32.9991 41.2861 34.0275 40.6914C35.0543 40.0984 36.2848 40.0967 37.3132 40.6914L38.1773 41.1909C40.5299 42.5479 43.5511 41.7396 44.9098 39.387L46.5526 36.5416C47.9146 34.1824 47.1079 31.1711 44.7488 29.8091ZM25.8132 34.6786C21.2838 34.6786 17.5989 30.9936 17.5989 26.4643C17.5989 21.9349 21.2838 18.25 25.8132 18.25C30.3426 18.25 34.0275 21.9349 34.0275 26.4643C34.0275 30.9936 30.3426 34.6786 25.8132 34.6786Z"
                fill="#FAFAFA"/>
        </svg>),
        text: 'Изготовление любой сложности',
    },
    {
        icon: (<svg width="52" height="52" viewBox="0 0 52 52" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path
                d="M46.2962 21.0397L43.7836 16.9955C43.2365 16.1146 42.4735 15.388 41.5672 14.8843C40.6607 14.3806 39.6409 14.1166 38.6039 14.1172H34.4073C34.307 14.1175 34.2072 14.1035 34.1108 14.0755C33.9353 14.0243 33.7759 13.929 33.6478 13.7987C33.5195 13.6684 33.4269 13.5074 33.3785 13.3311C33.3598 13.263 33.3482 13.1933 33.344 13.1229L33.3125 12.8984L33.1947 12.1753L33.085 11.507C32.8512 10.0802 32.1177 8.78288 31.0156 7.84703C29.9134 6.91118 28.5144 6.39774 27.0684 6.39844H8.83594C7.21977 6.39844 5.6698 7.04046 4.527 8.18326C3.38419 9.32606 2.74219 10.876 2.74219 12.4922V26.7211C2.70879 26.7141 2.67474 26.7107 2.64062 26.7109C2.50594 26.7109 2.37677 26.7645 2.28154 26.8596C2.18631 26.9549 2.13281 27.0841 2.13281 27.2188V34.6328C2.13281 34.7675 2.18631 34.8967 2.28154 34.9919C2.37677 35.0871 2.50594 35.1406 2.64062 35.1406C2.67928 35.1409 2.7178 35.1365 2.75538 35.1274C2.85523 36.6722 3.53927 38.1212 4.6686 39.18C5.79793 40.2387 7.2879 40.828 8.83594 40.8281H9.8678C9.96984 42.1006 10.5474 43.2879 11.4854 44.1537C12.4234 45.0195 13.6531 45.5003 14.9297 45.5003C16.2062 45.5003 17.4359 45.0195 18.374 44.1537C19.312 43.2879 19.8895 42.1006 19.9916 40.8281H32.2116C32.3132 42.0884 32.8814 43.2653 33.8048 44.1289C34.7283 44.9925 35.9407 45.4805 37.2049 45.4975C38.4691 45.5145 39.6942 45.0593 40.6406 44.2209C41.587 43.3825 42.1865 42.2213 42.3221 40.9642L47.646 41.0861C48.1824 41.0984 48.7019 40.898 49.0909 40.5286C49.48 40.1593 49.7073 39.651 49.723 39.1148L49.8672 34.2672C50.0012 29.603 48.7592 25.0027 46.2962 21.0397ZM43.745 27.5681L37.9641 27.3274C37.4871 27.3078 37.0323 27.1209 36.6794 26.7994C36.3266 26.478 36.0982 26.0425 36.0344 25.5694L35.1295 18.8439C35.0926 18.571 35.1146 18.2933 35.194 18.0297C35.2734 17.766 35.4083 17.5224 35.5896 17.3151C35.771 17.1079 35.9946 16.9418 36.2454 16.8282C36.4963 16.7145 36.7686 16.6559 37.0439 16.6563H37.7548C38.325 16.656 38.8891 16.7731 39.412 17.0003C39.935 17.2274 40.4056 17.5598 40.7946 17.9766L41.404 18.6296C43.3694 20.7375 44.6084 23.4194 44.9394 26.2823C44.9446 26.3268 44.9473 26.3716 44.9475 26.4164C44.9474 26.5719 44.9158 26.7259 44.8547 26.8689C44.7935 27.0119 44.7042 27.1411 44.5918 27.2486C44.4795 27.3562 44.3466 27.44 44.201 27.4949C44.0555 27.5497 43.9004 27.5747 43.745 27.5681Z"
                fill="#FAFAFA"/>
        </svg>),
        text: 'Доставка в любую точку Москвы и МО',
    }
];

const getCategories = async () => {
    return await QuestionsService.getQuestionsByCategories();
}

export const revalidate = 30;

export default async function Home() {
    const categories = await getCategories();

    return (
        <>
            <main className={styles.main}>
                <SliderScreen slides={startScreenSlides}/>
                <Advantages
                    elements={advantages}
                />
                <CatalogNav title='Мебель под любой запрос'/>
                <PhraseOrder/>
                <ProjectSequence/>
                <ExamplesSlider
                    slides={examplesSlides}
                    title='Примеры наших работ'
                />
                <ReviewsInfo/>
                <OrderForms/>
                <Questions
                    categories={categories}
                />
                <Footer isContact={true} />
            </main>
        </>
    );
}
